jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* flag */                                        



/* FRAM区域枚举 */
enum FramArea
{
    VALUE_AREA0,                       // 定值区0
    VALUE_AREA1,                       // 定值区1
    VALUE_AREA2,                       // 定值区2
    SOE_RECODE,                        // SOE数据
    SOE_NEW_RECODE,                    // 新SOE数据
    FEVENT_RECODE,                     // FAULT_EVENT数据
    CO_RECODE,                         // 操作记录  
    LOG_RECODE,                        // 日志记录   
	MEMORY_FLAG,                       // 记录标志缓存
    CFG_RECODE,                        // 配置    
    TELESIGNAL,                        // 遥信数据
    CURRENT_SN,                        // 当前定值区号
    FRAM_AREA_NUM                      // 分区数量
};

enum UpdateState
{
    UPDATE_START,    // 升级启动
	UPDATE_COMPLATE, // 更新完成
	UPDATE_BACK,     // 回退
	RUN_NOMAL        // 运行正常
};

struct RecordStateType
{
	uint8_t flag;
	int32_t position;
	int32_t num;
};

/* DATABASE----------------------------------------------------------------------*/
/* database数据操作类型 */
enum TelesignalAddr
{
	ADDR_OPEN,	
	ADDR_CLOSE,
    ADDR_OPERATING_MECHANISM,                             // 电容欠压(储能开入)
    ADDR_LOW_PRESSURE,                                    // 低气压
    ADDR_POWERFAULTALARM,                                 // 电源故障告警
    ADDR_BATTERY_UNDERVOLTAGE_ALARM,                      // 电池欠压告警
    ADDR_BATTERYACTIVATIONSTATUS,                         // 电池活化状态
    ADDR_BATTERY_LOSS_ALARM,                              // 电池失电告警
    ADDR_BREAK_CONTACT,                                   // 分断/联络
    ADDR_RECLOSE_FA_STRAP,                                // 重合硬/FA压板
    ADDR_FUNCTION_HARDSTRAP,                              // 功能投退硬压板
    ADDR_REMOTE_EARTH,                                    // 远方/就地
    ADDR_SHORT_CIRCUIT_FAULT,                             // 短路故障/过流保护
    ADDR_EARTHING_FAULT,                                  // 接地故障/零序保护
    ADDR_PROTECTION_ACT,                                  // 保护动作
    ADDR_PROTECTION_LOCK,                                 // 保护闭锁
    ADDR_CLOSING_LOCK,                                    // 合闸闭锁
    ADDR_OPENING_LOCK,                                    // 分闸闭锁    
    ADDR_RECLOSE_ACT,                                     // 重合动作
    ADDR_RECLOSE_LOCK,                                    // 重合闸闭锁
    ADDR_DEVICE_FAULT,                                    // 装置故障
    ADDR_SELF_CHECK_ABNOMAL,                              // 自检异常
    ADDR_COMMUNICATION,                                   // 通讯 
    ADDR_SWTICHCLASS,                                     // 开关类型
    ADDR_BATTERY_FAULT_ALARM,                             // 电池故障告警
    ADDR_DOUBLE_SWITCH,                                   // 双点开关分合
    ADDR_CONTROL_LOOP_DISCONNECTION,                      // 控制回路断线
    ADDR_OVERCURRENT_IA_1,                                // A相过流一段保护
    ADDR_OVERCURRENT_IB_1,                                // B相过流一段保护
    ADDR_OVERCURRENT_IC_1,                                // C相过流一段保护
    ADDR_OVERCURRENT_IA_2,                                // A相过流二段保护
    ADDR_OVERCURRENT_IB_2,                                // A相过流二段保护
    ADDR_OVERCURRENT_IC_2,	                              // A相过流二段保护
    ADDR_OVERCURRENT_IA_3,                                // A相过流三段保护
    ADDR_OVERCURRENT_IB_3,                                // A相过流三段保护
    ADDR_OVERCURRENT_IC_3,	                              // A相过流三段保护
    ADDR_OVERCURRENT_I0_1,                                // 零序过流一段保护
    ADDR_OVERCURRENT_I0_2,	                              // 零序过流二段保护
    ADDR_OVERCURRENT_ACC_IA,                              // A相后加速过流
    ADDR_OVERCURRENT_ACC_IB,                              // B相后加速过流
    ADDR_OVERCURRENT_ACC_IC,                              // C相后加速过流
    ADDR_OVERCURRENT_INVERSE_IA,                          // A相反时限过流
    ADDR_OVERCURRENT_INVERSE_IB,                          // B相反时限过流
    ADDR_OVERCURRENT_INVERSE_IC,                          // C相反时限过流
    ADDR_RECLOSE_PROTECTION_1,                            // 重合闸一次保护
    ADDR_RECLOSE_PROTECTION_2,                            // 重合闸二次保护
    ADDR_RECLOSE_PROTECTION_3,                            // 重合闸三次保护
    ADDR_RECLOSE_PROTECTION_4,                            // 重合闸四次保护
    ADDR_RECLOSE_CLOCK_PROTECTION,                        // 重合闸闭锁保护
    ADDR_ZERO_RECLOSE_PROTECTION_1,                       // 零序重合闸一次保护
    ADDR_ZERO_RECLOSE_PROTECTION_2,                       // 零序重合闸二次保护
    ADDR_CLOCK_SECONDARY_CLOSE,                           // 闭锁二次重合闸
    ADDR_LOSS_TRIP,                                       // 失电跳闸
    ADDR_GET_CLOSSING_EVENT,                              // 得电合闸事件
    ADDR_CLOSING_FAULT,                                   // 合闸于故障
    ADDR_PROTECT_CLOCK,                                   // 保护闭锁
    ADDR_DOUBLE_PROHIBIT_CLOSSING,                        // 双侧有压禁止合闸
    ADDR_SINGLE_LOSS_CLOSING_EVENT,                       // 单侧失压延时合闸事件
    ADDR_REMAIN_CLOCK_CLOSSING,                           // 残压闭锁合闸
    ADDR_U0_EARTHING_FAULT_TRIP,                          // 零序电压接地故障跳闸
    ADDR_SMALL_SIGNAL_GROUND_LINE_TRIP,                   // 小信号接地选线跳闸
    ADDR_BREAKINGCURRENT,                                 // 遮断电流
    ADDR_OVERLOAD_EVENT,                                  // 过负荷事件
    ADDR_HAVEY_OVERLOAD_EVENT,                            // 重过载	
    ADDR_OVER_VOLTAGE_PROTECTION,                         // 过压保护
	ADDR_OVER_FREQUEBNCY_PROTECTION,                      // 过频
    ADDR_DOWN_VOLTAGE_PROTECTION,                         // 低压保护
	ADDR_DOWN_FREQUEBNCY_PROTECTION,                      // 低频		
    ADDR_OVERLIMIT_Uab_UP,                                // A相电压越限
    ADDR_OVERLIMIT_Uab_DOWN,                              // A相电压越限
    ADDR_OVERLIMIT_UBC_UP,                                // B相电压越限
    ADDR_OVERLIMIT_UBC_DOWN,                              // B相电压越限
    ADDR_OVERLIMIT_Uca_UP,                                // C相电压越限
    ADDR_OVERLIMIT_Uca_DOWN,                              // C相电压越限
    ADDR_OVERLIMIT_U0_UP,                                 // 零序电压越限
    ADDR_OVERLIMIT_U0_DOWN,                               // 零序电压越限
    ADDR_OVERLIMIT_IA_UP,                                 // A相电流越限
    ADDR_OVERLIMIT_IA_DOWN,                               // A相电流越限
    ADDR_OVERLIMIT_IB_UP,                                 // B相电流越限
    ADDR_OVERLIMIT_IB_DOWN,                               // B相电流越限
    ADDR_OVERLIMIT_IC_UP,                                 // C相电流越限
    ADDR_OVERLIMIT_IC_DOWN,                               // C相电流越限
    ADDR_OVERLIMIT_I0_UP,                                 // 零序电流越限
    ADDR_OVERLIMIT_I0_DOWN,                               // 零序电流越限
    ADDR_OVERLIMIT_DC_U_UP,                               // 直流电压越限
    ADDR_OVERLIMIT_DC_U_DOWN,                             // 直流电压越限
    ADDR_OVERLIMIT_DC_I_UP,                               // 直流电流越限
    ADDR_OVERLIMIT_DC_I_DOWN,                             // 直流电流越限
    ADDR_DEVICE_POWER_DOWN,                               // 装置掉电
	
	TELESIGNAL_NUM
};

/* 遥信数据 */
typedef union TagTelesignalDatabase
{
    struct Telesignal
    {
        rt_uint8_t switchOpen;               // 开关分位
        rt_uint8_t switchClose;              // 开关合位
        rt_uint8_t operatingMechanism;       // 弹簧储能/永磁电容欠压
        rt_uint8_t lowPressure;              // 低气压
        rt_uint8_t powerFaultAlarm;          // 电源故障告警
        rt_uint8_t batteryUnderVoltageAlarm; // 电池欠压告警
        rt_uint8_t batteryActivationStatus;  // 电池活化状态
        rt_uint8_t batteryLossAlarm;         // 电池失电告警
        rt_uint8_t breakContact;             // 分断/联络	(模式)
        union
        {
            rt_uint8_t recloseHardStrap;     // 重合闸硬压板
            rt_uint8_t faHardStrap;          // FA功能投退硬压板
        } FA;
        rt_uint8_t functionHardStrap;        // 功能投退硬压板
        rt_uint8_t remoteEarth;              // 远方/就地
        rt_uint8_t shortCircuitFault;        // 短路故障/过流保护
        rt_uint8_t earthingFault;            // 接地故障/零序保护
        rt_uint8_t protectionAct;            // 保护动作
        rt_uint8_t protectionLock;           // 保护闭锁
        rt_uint8_t closingLocked;            // 合闸闭锁
        rt_uint8_t openingLockedEvent;       // 分闸闭锁事件
        rt_uint8_t recloseAct;               // 重合动作
        rt_uint8_t recloseLock;  			  // 重合闭锁
        rt_uint8_t deviceFault;              // 装置故障
		rt_uint8_t selfCheckAbnomal;         // 自检异常
		rt_uint8_t communication;            // 通讯
        rt_uint8_t swtichclass;              // 开关类型		
        rt_uint8_t batteryLowVoltageAlarm;   // 蓄电池低压告警(直流量)
        rt_uint8_t doubleSwitch;             // 双点开关分合
        rt_uint8_t controlLoopDisconnection; // 控制回路断线
        rt_uint8_t overcurrentIa1;           // A相过流一段保护
        rt_uint8_t overcurrentIb1;           // B相过流一段保护
        rt_uint8_t overcurrentIc1;           // C相过流一段保护
        rt_uint8_t overcurrentIa2;           // A相过流二段保护
        rt_uint8_t overcurrentIb2;           // B相过流二段保护
        rt_uint8_t overcurrentIc2;           // C相过流二段保护
        rt_uint8_t overcurrentIa3;           // A相过流三段保护
        rt_uint8_t overcurrentIb3;           // B相过流三段保护
        rt_uint8_t overcurrentIc3;           // C相过流三段保护
        rt_uint8_t overcurrentI01;           // 零序过流一段保护
        rt_uint8_t overcurrentI02;           // 零序过流二段保护
        rt_uint8_t overcurrentAccIa;		  // A相后加速过流
        rt_uint8_t overcurrentAccIb;		  // B相后加速过流
        rt_uint8_t overcurrentAccIc;		  // C相后加速过流
        rt_uint8_t overcurrentInverseIa;	  // A相反时限过流
        rt_uint8_t overcurrentInverseIb;	  // B相反时限过流
        rt_uint8_t overcurrentInverseIc;	  // C相反时限过流
        rt_uint8_t recloseProtection1;		  // 重合闸一次保护
        rt_uint8_t recloseProtection2;		  // 重合闸二次保护
        rt_uint8_t recloseProtection3;		  // 重合闸三次保护
        rt_uint8_t recloseProtection4;		  // 重合闸四次保护
        rt_uint8_t recloseClockProtection;	  // 重合闸闭锁保护
        rt_uint8_t zeroRecloseProtection1;   // 零序重合闸一次保护
        rt_uint8_t zeroRecloseProtection2;   // 零序重合闸二次保护
        rt_uint8_t clockSecondaryClose;      // 闭锁二次重合闸
        rt_uint8_t lossTrip;                 // 失电跳闸
        rt_uint8_t getClossingEvent;		  // 得电合闸事件
        rt_uint8_t closingFaultEvent;        // 合闸于故障
        rt_uint8_t protectionLockedEvent;    // 保护闭锁事件
        rt_uint8_t doubleProhibitClossing;   // 双侧有压禁止合闸
        rt_uint8_t singleLossClosingEvent;   // 单侧失压延时合闸事件
        rt_uint8_t remainClockClossing;      // 残压闭锁合闸
        rt_uint8_t earthingFaultTripU0;      // 零序电压接地故障跳闸
        rt_uint8_t smallSignalEarthingTrip;  // 小信号接地选线跳闸
        rt_uint8_t breakingCurrent;          // 遮断电流
        rt_uint8_t overloadEvent;            // 过负荷事件		
        rt_uint8_t haveyOverload;            // 重过载
        rt_uint8_t overVoltageProtection;    // 过压保护
        rt_uint8_t overFrequencyProtection;  // 过频保护		
        rt_uint8_t downVoltageProtection;    // 低压保护	
        rt_uint8_t downFrequencyProtection;  // 低频保护
        rt_uint8_t overLimitUaUp;            // A相电压越上限
        rt_uint8_t overLimitUaDown;          // A相电压越下限
        rt_uint8_t overLimitUbUp;            // B相电压越上限
        rt_uint8_t overLimitUbDown;          // B相电压越下限
        rt_uint8_t overLimitUcUp;            // C相电压越上限
        rt_uint8_t overLimitUcDown;          // C相电压越下限
        rt_uint8_t overLimitU0Up;            // 零序电压越上限
        rt_uint8_t overLimitU0Down;          // 零序电压越下限
        rt_uint8_t overLimitIaUp;            // A相电压越上限
        rt_uint8_t overLimitIaDown;          // A相电压越下限
        rt_uint8_t overLimitIbUp;            // B相电压越上限
        rt_uint8_t overLimitIbDown;          // B相电压越下限
        rt_uint8_t overLimitIcUp;            // C相电压越上限
        rt_uint8_t overLimitIcDown;          // C相电压越下限
        rt_uint8_t overLimitI0Up;            // 零序电压越上限
        rt_uint8_t overLimitI0Down;          // 零序电压越下限
        rt_uint8_t overLimitDC_U_Up;         // 直流电压越上限
        rt_uint8_t overLimitDC_U_Down;       // 直流电压越下限
        rt_uint8_t overLimitDC_I_Up;         // 直流电流越限
        rt_uint8_t overLimitDC_I_Down;       // 直流电流越限
        rt_uint8_t devicePowerDown;          // 装置掉电
    }Str;

    rt_uint8_t buf[sizeof(struct Telesignal)];

}TelesignalDatabase;

enum TelemetryAddr
{
	ADDR_F,
    ADDR_IA,
    ADDR_IB,
    ADDR_IC,
    ADDR_I0,
    ADDR_Uab,
    ADDR_Ubc,
    ADDR_Uca,
    ADDR_U0,
    ADDR_UAB,
    ADDR_UBC,
	ADDR_P,
    ADDR_Q,
    ADDR_S,
    ADDR_PF,
    ADDR_DC1,
    ADDR_DC2,
    ADDR_T,
	ADDR_AIPHY_Ua_Ia,
	ADDR_AIPHY_Ub_Ib,
	ADDR_AIPHY_UC_Ic,
    ADDR_AIPHY_U0_I0,
    ADDR_ALPHY_Uab_UBC,		
	ADDR_Ia_ONCE,
	ADDR_Ib_ONCE,
	ADDR_Ic_ONCE,
	ADDR_I0_ONCE,	
    ADDR_Uab_ONCE,
    ADDR_Ubc_ONCE,
    ADDR_Uca_ONCE,
    ADDR_U0_ONCE,
    ADDR_UAB_ONCE,
    ADDR_UBC_ONCE,
	ADDR_P_ONCE,
    ADDR_Q_ONCE,
    ADDR_S_ONCE,
    VOLTAGE_PASS_RATE,
	THIRDHARMONIC_Uab,
	THIRDHARMONIC_Ubc,
	THIRDHARMONIC_Uca,
	THIRDHARMONIC_U0,
//	THIRDHARMONIC_UAB,
//	THIRDHARMONIC_UBC,
	THIRDHARMONIC_Ia,
	THIRDHARMONIC_Ib,
	THIRDHARMONIC_Ic,
	THIRDHARMONIC_I0,
	FIFTHHARMONIC_Uab,
	FIFTHHARMONIC_Ubc,
	FIFTHHARMONIC_Uca,
	FIFTHHARMONIC_U0,
//	FIFTHHARMONIC_UAB,
//	FIFTHHARMONIC_UBC,
	FIFTHHARMONIC_Ia,
	FIFTHHARMONIC_Ib,
	FIFTHHARMONIC_Ic,
	FIFTHHARMONIC_I0,

