jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
    TELEMETRY_NUM
};
    
/* 遥测数据 */
typedef union TagTelemetryDatabase
{
    struct Telemetry
    {
        float frequency;                // 频率
        float Ia;                       // A相电流
        float Ib;                       // B相电流
        float Ic;                       // C相电流
        float I0;                       // 零序电流
        float Uab;                      // 线电压Uab
        float Ubc;                      // 线电压Ubc
        float Uac;                      // 线电压Uac
        float U0;                       // 零序电压
        float UAB;                      // 线电压Uab
        float UBC;                      // 线电压Ubc
        float P;                        // 有功功率
        float Q;                        // 无功功率
        float S;                        // 视在功率
        float pf;                       // 功率因数
        float Alpha0;                    // 零序夹角
        float AlphaU;                    // 电源测负载测电压夹角		
        float DCVoltage;                // 直流电压
        float DCSpare;                  // 直流量备用
        float temprature;               // 温度
        float onceIa;                   // A相电流
        float onceIb;                   // B相电流
        float onceIc;                   // C相电流
        float onceI0;                   // 零序电流
        float onceUab;                  // 线电压Uab
        float onceUbc;                  // 线电压Ubc
        float onceUac;                  // 线电压Uac
        float onceU0;                   // 零序电压
        float onceUAB;                  // 线电压UAB
        float onceUBC;                  // 线电压UBC
        float onceP;                    // 有功功率
        float onceQ;                    // 无功功率
        float onceS;                    // 视在功率
        float voltagePassRate;          // 电压合格率
        float thirdHarmonicUab;         // 三次谐波
        float thirdHarmonicUbc;         // 三次谐波
        float thirdHarmonicUac;         // 三次谐波
        float thirdHarmonicU0;          // 三次谐波
        float thirdHarmonicIa;          // 三次谐波
        float thirdHarmonicIb;          // 三次谐波
        float thirdHarmonicIc;          // 三次谐波
        float thirdHarmonicI0;          // 三次谐波
        float fifthHarmonicUab;         // 五次谐波
        float fifthHarmonicUbc;         // 五次谐波
        float fifthHarmonicUac;         // 五次谐波
        float fifthHarmonicU0;          // 五次谐波
        float fifthHarmonicIa;          // 五次谐波
        float fifthHarmonicIb;          // 五次谐波
        float fifthHarmonicIc;          // 五次谐波
        float fifthHarmonicI0;          // 五次谐波
    }Str;

    float buf[sizeof(struct Telemetry) / sizeof(float)];
}TelemetryDatabase;

/* PARA ----------------------------------------------------------------------*/
#define RT_SYS_CONFIG_DEFAULT                           \
{                                                       \
    "F31                     ",                         \
    "RT-Thread               ",                         \
    "                        ",                         \
    "HV01.01                 ",                         \
    "SV03.021                ",                         \
    "CRC                     ",                         \
    "101 / 104               ",                         \
    "SJFD2000                ",                         \
    "F31xxxxxxxxx20171211xxxx",                         \
    "                        ",	                        \
    TERMINAL_PRODUCT_SERIAL_NUMBER                      \
}

#define SIZEOFINTRIPARAME             24          // 固有参数长度

#define SN_MIN                        0           // 最小定值区号
#define SN_MAX                        2           // 最大定值区号
#define DB_SN0                        0           // 0区
#define DB_SN1                        1           // 1区
#define DB_SN2                        2           // 2区
#define DB_CALI                       3           // 校准系数区

enum ParameterType
{
    ZERODRIFT,
    DEADZONE,
    CALIBRATE_FACTOR,
};

struct Inherent
{
    char terminalType[SIZEOFINTRIPARAME];                      // 终端类型
    char terminalOpreatSystem[SIZEOFINTRIPARAME];              // 终端操作系统
    char terminalManufacturer[SIZEOFINTRIPARAME];              // 终端制造商
    char terminalHardwareVersion[SIZEOFINTRIPARAME];           // 终端硬件版本
    char terminalSoftwareVersion[SIZEOFINTRIPARAME];           // 终端软件版本
    char terminalSoftwareVersionCheckCode[SIZEOFINTRIPARAME];  // 终端软件版本校验码
    char terminalCommunicationProtocolType[SIZEOFINTRIPARAME]; // 终端通信规约类型
    char terminalFactoryModel[SIZEOFINTRIPARAME];              // 终端出厂型号
    char terminalID[SIZEOFINTRIPARAME];                        // 终端ID号
    char terminalMAC[SIZEOFINTRIPARAME];                       // 终端网卡MAC地址
    char terminalProductSerialNumber[SIZEOFINTRIPARAME];                       // 终端产品序列号
};

		
typedef union TagInherentPara
{
    struct Inherent Str;
    char buf[sizeof(struct Inherent) / sizeof(char)];
} InherentPara;

enum AddrRunParameter
{
    OPERATING_MECHANISM,                  // 操作机构(0-弹簧/1-永磁)
	SWITCH_TYPE,						  // 开关类型(0-断路器/1-负荷开关)
	BREAK_WORK_MODE,                      // 断路器工作模式(0-无/1-常规保护/2-电压时间型/3-电压电流型/4-电流计数型)
	LOAD_WORK_MODE,                       // 负荷开关工作模式(0-无/1-电压时间型/2-电压电流型/3-电流计数型/4-分界负荷开关型)
	CONNECT_SWITCH_RECOGNIZE,             // 联络开关识别
	OUTPUT_OVERTURN,                      // 永磁输出翻转
	CAP_UNDERVOLTAGE_CLOSING,	          // 合闸电容欠压定值
	CAP_UNDERVOLTAGE_OPENING,             // 分闸电容欠压定值
	CAP_UNDERVOLTAGE_FACTOR,			  // 电容欠压返回系数
	RATIO_U_ONE_TURN,                     // 电压变比一次	
	RATIO_U_SECONDARY,                    // 电压变比二次
	RATIO_U0_ONE_TURN,                    // 零序电压变比一次
	RATIO_U0_SECONDARY,                   // 零序电压变比二次	
	RATIO_I_ONE_TURN,                     // 电流变比一次	
	RATIO_I_SECONDARY,                    // 电流变比二次
	RATIO_I0_ONE_TURN,                    // 零序电流一次变比
	RATIO_I0_SECONDARY,                   // 零序电流二次变比	
    DI_SHAKING_TIME,                      // 开入采集防抖时间 
    CLOSING_PULSE_TIME,                   // 合闸脉宽时间
    OPENING_PULSE_TIME,			          // 分闸脉宽时间
    REVERSE_TIME,                         // 反校时间
    ZERODRIFT_F,                          // 频率零漂
    ZERODRIFT_Ia,                         // A相电流零漂 
    ZERODRIFT_Ib,                         // B相电流零漂
    ZERODRIFT_Ic,                         // C相电流零漂
    ZERODRIFT_I0,                         // 零序电流零漂
    ZERODRIFT_Uab,                        // 线电压Uab零漂
    ZERODRIFT_Ubc,                        // 线电压Ubc零漂
    ZERODRIFT_Uca,                        // 线电压Uac零漂
    ZERODRIFT_U0,                         // 零序电压零漂
    ZERODRIFT_UAB,                        // 线电压Uab零漂
    ZERODRIFT_UBC,                        // 线电压Ubc零漂
    ZERODRIFT_P,                          // 有功功率零漂
    ZERODRIFT_Q,                          // 无功功率零漂
    ZERODRIFT_S,                          // 视在功率零漂
    ZERODRIFT_PF,                         // 功率因数零漂	
    ZERODRIFT_DC1,                        // 直流电压零漂	
    ZERODRIFT_DC2,                        // 直流电压2零漂
    ZERODRIFT_T,                          // 温度零漂	
    DEADZONE_F,                           // 频率死区
    DEADZONE_Ia,                          // A相电流死区
    DEADZONE_Ib,                          // B相电流死区
    DEADZONE_Ic,                          // C相电流死区
    DEADZONE_I0,                          // 零序电流死区
    DEADZONE_Uab,                         // 线电压Uab死区
    DEADZONE_Ubc,                         // 线电压Ubc死区
    DEADZONE_Uca,                         // 线电压Uac死区
    DEADZONE_U0,                          // 零序电压死区
    DEADZONE_UAB,                         // 线电压Ubc死区
    DEADZONE_UBC,                         // 线电压Uac死区
    DEADZONE_P,                           // 有功功率死区
    DEADZONE_Q,                           // 无功功率死区
    DEADZONE_S,                           // 视在功率死区
    DEADZONE_PF,                          // 功率因数死区
    DEADZONE_DC1,                         // 直流电压死区
    DEADZONE_DC2,                         // 直流量2死区
    DEADZONE_T,				              // 温度死区	
	
    RUN_PARAMETER_NUM,	                  // 运行参数数量
};
	
// 运行参数
typedef union TagRunParameter
{
    struct Run
    {
        float operatingMechanism;                 // 操作机构(0-弹簧/1-永磁)
		float switchType;						  // 开关类型(0-断路器/1-负荷开关)
		float breakWorkMode;                      // 断路器工作模式(0-无/1-常规保护/2-电压时间型/3-电压电流型/4-电流计数型)
		float loadWorkMode;                       // 负荷开关工作模式(0-无/1-电压时间型/2-电压电流型/3-电流计数型/4-分界负荷开关型)
		float connectSwitchRecognize;             // 联络开关识别
        float outputOverturn;                     // 永磁输出翻转
        float capUnderVoltageClosing;	          // 合闸电容欠压定值
        float capUnderVoltageOpening;             // 分闸电容欠压定值
        float capUnderVoltageFactor;			  // 电容欠压返回系数 
        float ratioUOneTurn;                      // 电压变比一次		
        float ratioUSecondary;                    // 电压变比二次
		float ratioU0OneTurn;                     // 零序电压变比一次
        float ratioU0Secondary;                   // 零序电压变比二次
		float ratioIOneTurn;                      // 电流变比一次		
        float ratioISecondary;                    // 电流变比二次
		float ratioI0OneTurn;                     // 零序电流一次变比
        float ratioI0Secondary;                   // 零序电流二次变比		        
        float diShakingTime;                      // 开入采集防抖时间 
        float closingPulseTime;                   // 合闸脉宽时间
        float openingPulseTime;			          // 分闸脉宽时间
        float reverseTime;                        // 反校时间
        float zerodriftF;                         // 频率零漂
        float zerodriftIa;                        // A相电流零漂
        float zerodriftIb;                        // B相电流零漂
        float zerodriftIc;                        // C相电流零漂
        float zerodriftI0;                        // 零序电流零漂
        float zerodriftUab;                       // 线电压Uab零漂
        float zerodriftUbc;                       // 线电压Ubc零漂
        float zerodriftUac;                       // 线电压Uac零漂
        float zerodriftU0;                        // 零序电压零漂
        float zerodriftUAB;                       // 线电压Uab零漂
        float zerodriftUBC;                       // 线电压Ubc零漂
        float zerodriftP;                         // 有功功率零漂
        float zerodriftQ;                         // 无功功率零漂
        float zerodriftS;                         // 视在功率零漂
        float zerodriftPF;                        // 功率因数零漂
        float zerodriftDC;                        // 直流电压零漂
        float zerodriftDC2;                       // 直流电压2零漂
        float zerodriftT;                         // 温度零漂
        float deadzoneF;                          // 频率死区
        float deadzoneIa;                         // A相电流死区
        float deadzoneIb;                         // B相电流死区
        float deadzoneIc;                         // C相电流死区
        float deadzoneI0;                         // 零序电流死区
        float deadzoneUab;                        // 线电压Uab死区
        float deadzoneUbc;                        // 线电压Ubc死区
        float deadzoneUac;                        // 线电压Uac死区
        float deadzoneU0;                         // 零序电压死区
        float deadzoneUAB;                        // 线电压Ubc死区
        float deadzoneUBC;                        // 线电压Uac死区
        float deadzoneP;                          // 有功功率死区
        float deadzoneQ;                          // 无功功率死区
        float deadzoneS;                          // 视在功率死区
        float deadzonePf;                         // 功率因数死区
        float deadzoneDC;                         // 直流电压死区
        float deadzoneDC2;                        // 直流量2死区
        float deadzoneT;				          // 温度死区
    } Str;

    float buf[sizeof(struct Run) / sizeof(float)];   // 终端运行参数存储区
} RunParameter;

enum AddrCalibrateFactor
{
    CALIFACTOR_F,                        // 频率校准系数
	CALIFACTOR_Ia,                       // A相电流(Ia)校准系数
	CALIFACTOR_Ib,                       // B相电流(Ib)校准系数
    CALIFACTOR_Ic,                       // C相电流(Ic)校准系数
	CALIFACTOR_I0,                       // 零序电流(I0)校准系数
    CALIFACTOR_Uab,                      // 线电压(Uab)校准系数
	CALIFACTOR_Ubc,                      // 线电压(Ubc)校准系数
    CALIFACTOR_Uca,                      // 线电压(Uca)校准系数
	CALIFACTOR_U0,                       // 零序电压(U0)校准系数
    CALIFACTOR_UAB,                      // 线电压(Uab)校准系数
	CALIFACTOR_UBC,                      // 线电压(Ubc)校准系数
    CALIFACTOR_P,                        // 有功功率(p)校准系数（无效）
	CALIFACTOR_Q,                        // 无功功率(Q)校准系数（无效）
    CALIFACTOR_S,                        // 视在功率(S)校准系数（无效）
	CALIFACTOR_PF,                       // 功率因数(Pf)校准系数（无效） 		
    CALIFACTOR_DC1,                      // 直流电压(V)校准系数
	CALIFACTOR_DC2,                      // 直流电压(V)校准系数
    CALIFACTOR_T,			             // 温度(T)校准系数
	CALIFACTOR_ALPHA_UaIa,	             // 角UaIa校准系数
	CALIFACTOR_ALPHA_UbIb,	             // 角UbIb校准系数
	CALIFACTOR_ALPHA_UCIc,	             // 角UcIc校准系数
	CALIFACTOR_ALPHA_U0I0,	             // 角U0I0校准系数
	CALIFACTOR_ALPHA_UaUb,	             // 角UaUb校准系数		
	
	CALIFACTOR_NUM
};
// 校准系数
typedef union TagCalibrateFactor
{
    struct Calibrate
    {
        float califactorF;                        // 频率校准系数
        float califactorIa;                       // A相电流(Ia)校准系数
        float califactorIb;                       // B相电流(Ib)校准系数
        float califactorIc;                       // C相电流(Ic)校准系数
        float califactorI0;                       // 零序电流(I0)校准系数
        float califactorUab;                      // 线电压(Uab)校准系数
        float califactorUbc;                      // 线电压(Ubc)校准系数
        float califactorUac;                      // 线电压(Uac)校准系数
        float califactorU0;                       // 零序电压(U0)校准系数
        float califactorUAB;                      // 线电压(Uab)校准系数
        float califactorUBC;                      // 线电压(Ubc)校准系数
        float califactorP;                        // 有功功率(p)校准系数（无效）
        float califactorQ;                        // 无功功率(Q)校准系数（无效）
        float califactorS;                        // 视在功率(S)校准系数（无效）
        float califactorPf;                       // 功率因数(Pf)校准系数（无效）
        float califactorL0;                       // 零序角度(L)校准系数（无效）   
        float califactorU;                        // 电压角度(U)校准系数（无效）   		
        float califactorDC;                       // 直流电压(V)校准系数
        float califactorDC2;                      // 直流电压(V)校准系数
        float califactorT;			              // 温度(T)校准系数
        float califactorAlphaUaIa;	              // 角UaIa校准系数
        float califactorAlphaUbIb;	              // 角UbIb校准系数
        float califactorAlphaUcIc;	              // 角UcIc校准系数
        float califactorAlphaU0I0;	              // 角UcIc校准系数
        float califactorAlphaUaUb;	              // 角UaUb校准系数		
    } Str;

    float buf[sizeof(struct Calibrate) / sizeof(float)];

} CalibrateFactor;

enum AddrFixedValue
{
    OVER_CURRENT_SWITCH1,                // 过流1段投退 “1投入”、“0退出”
    DIRE_CTIONLOCK_SWITCH1,              // 过流1段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE1,                 // 过流1段电流 流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME1,                  // 过流1段时间 时间定值，整定范围：00.00s~99.99s
    OVER_CURRENT_SWITCH2,                // 过流2段投退 “1投入”、“0退出”
    DIRE_CTIONLOCK_SWITCH2,              // 过流2段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE2,                 // 过流2段电流 电流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME2,                  // 过流2段时间 时间定值，整定范围：00.00s~99.99s    
	OVER_CURRENT_SWITCH3,                // 过流3段投退 “1投入”、“0退出”
    DIRE_CTIONLOCK_SWITCH3,              // 过流3段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE3,                 // 过流3段电流 电流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME3,                  // 过流3段时间 时间定值，整定范围：00.00s~99.99s	
    OVER_CURRENTI0_SWITCH1,              // 零序过流1段投退 “1投入”、“0退出”
	OVER_CURRENTI0_VALUE1,               // 零序过流1段电流 流定值，整定范围：00.00A~99.99A
	OVER_CURRENTI0_TIME1,                // 零序过流1段时间 时间定值，整定范围：00.00s~99.99s	
    OVER_CURRENTI0_SWITCH2,              // 零序过流2段投退 “1投入”、“0退出”
	OVER_CURRENTI0_VALUE2,               // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
	OVER_CURRENTI0_TIME2,                // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s		
	OVERLIMIT_SWITCH,                    // 越限报警功能投退
	UPLIMIT_FACTOR,                      // 越限上限系数
	DOWNLIMIT_FACTOR,                    // 越限下限系数
    OVERLIMIT_TIME,                      // 越限延时
	OVERLIMIT_ALARM_SWITCH_Uab,          // Uab越限报警投退 
	OVERLIMIT_ALARM_SWITCH_UBC,          // Ubc越限报警投退
	OVERLIMIT_ALARM_SWITCH_Uca,          // Uac越限报警投退
	UPLIMIT_VOLTAGE_U,                   // 电压上限定值
	DOWNLIMIT_VOLTAGE_U,                 // 电压下限定值
	OVERLIMIT_ALARM_SWITCH_IA,           // Ia越限报警投退
	OVERLIMIT_ALARM_SWITCH_IB,           // Ib越限报警投退
	OVERLIMIT_ALARM_SWITCH_IC,           // Ic越限报警投退
	UPLIMIT_CURRENT_I,                   // 电流上限定值
	DOWNLIMIT_CURRENT_I,                 // 电流下限定值	
	OVERLIMIT_ALARM_SWITCH_U0,           // 零序电压越限投退	
	UPLIMIT_VOLTAGE_U0,                  // 零序电压上限定值
	DOWNLIMIT_VOLTAGE_U0,                // 零序电压下限定值
	OVERLIMIT_ALARM_SWITCH_I0,           // 零序电流越限投退	
	UPLIMIT_VOLTAGE_I0,                  // 零序电流上限定值
	DOWNLIMIT_VOLTAGE_I0,                // 零序电流下限定值	
	OVERLIMIT_ALARMSWITCH_DC_U,          // 直流电压越限投退
	UPLIMIT_DC_VOLTAGE_U,                // 直流电压上限定值
	DOWNLIMIT_DC_VOLTAGE_U,              // 直流电压下限定值
	OVERLIMIT_ALARMSWITCH_DC_I,          // 直流电流越限投退
	UPLIMIT_DC_CURRENT_I,                // 直流电流上限定值
	DOWNLIMIT_DC_CURRENT_I,              // 直流电流下限定值	
	HEAVY_OVERLOAD_SWITCH,               // 重过载保护投退
	HEAVY_OVERLOAD_VALUE,                // 重过载定值
	HEAVY_OVERLOAD_FACTOR,               // 重过载返回系数		
	HEAVY_OVERLOAD_TIME,                 // 重过载延时	
	OVERLOAD_SWITCH,                     // 过负荷保护投退
	OVERLOAD_VALUE,                      // 过负荷定值
	OVERLOAD_FACTOR,                     // 过负荷返回系数		
	OVERLOAD_TIME,	                     // 过负荷延时
    BATTERY_LOWVOLTAGE_ALARM_SWITCH,     // 蓄电池低压报警投退	
	BATTERY_LOWVOLTAGE_VALUE,            // 电池低压定值
	BATTERY_LOWVOLTAGE_FACTOR,           // 电池低压返回系数		
	BATTERY_LOWVOLTAGE_TIME,             // 电池低压延时	
    BATTERY_ACTIVE_SWITCH,               // 电池活化投退
    BATTERY_ACTIVE_CYCLE,                // 电池活化周期(天)
    BATTERY_ACTIVE_TIME,                 // 电池活化时间(h)
    BATTERY_ACTIVE_FAULT_VOLTAGE,        // 电池活化故障电压
    BATTERY_ACTIVE_FAULT_TIME,           // 电池活化故障延时
	AUTOMATIC_RESET_SWITCH,              // 自动复归使能
	AUTOMATIC_RESET_TIME,                // 自动复位时间
	OVERVOLTAGE_SWITCH,                  // 过压投退
	OVERVOLTAGE_VALUE,                   // 过压定值
    OVERVOLTAGE_TIME,                    // 过压时间
    OVERVOLTAGE_FACTOR,                  // 过压返回系数	
	OVERFREQUENCY_SWITCH,                // 过频投退
	OVERFREQUENCY_VALUE,                 // 过频定值
    OVERFREQUENCY_TIME,                  // 过频时间
    OVERFREQUENCY_FACTOR,                // 过频返回系数	
	DOWNVOLTAGE_SWITCH,                  // 低压投退
	DOWNVOLTAGE_VALUE,                   // 低压定值
    DOWNVOLTAGE_TIME,                    // 低压时间
    DOWNVOLTAGE_FACTOR,                  // 低压返回系数	
	DOWNFREQUENCY_SWITCH,                // 低频投退
	DOWNFREQUENCY_VALUE,                 // 低频定值
    DOWNFREQUENCY_TIME,                  // 低频时间
    DOWNFREQUENCY_FACTOR,                // 低频返回系数	
    CLOSING_LOOP_SWITCH,                 // 合环功能投退
    VOLTAGE_DIFFERENCE,                  // 两侧压差	
	PHASEANGLE_DIFFERENCE,				 // 相角差
    CONTROL_LOOP_ABNOMAL_ENABLE,         // 控制回路异常使能	
	INVERSE_SWITCH,                      // 反时限投退
	INVERSE_CURRENT_VALUE,               // 反时限保护电流值
	INVERSE_TIME,                        // 反时限保护延时
	IACC_SWITCH,                         // 后加速投退 软压板定值，可以选择“投入”、“退出"
	IACC_CURRENT_VALUE,                  // 后加速电流 电流定值，整定范围：00.00s~99.99A
	IACC_TIME,                           // 后加速时间 时间定值，整定范围：00.00s~99.99s	
	INRUSH_SWITCH,                       // 涌流抑制投退 软压板定值，可以选择“投入”、“退出”
	INRUSH_TIME,                         // 涌流抑制时间 时间定值，整定范围：0000~9999ms
	SECONDARY_RECLOSE_LOCK_SWITCH,       // 二次重合闸闭锁投退
	SECONDARY_RECLOSE_LOCK_TIME,         // 闭锁二次重合闸时间 时间定值，整定范围：00.00s~99.99
	RECLOSE_TIMES_I,                     // 重合闸次数 可以选择：0，1，2，3，4
	RECLOSE_TIMES_I0,                    // 零序重合闸次数 可以选择：0，1，2
	RECLOSE_TIMER1,                      // 1次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER2,                      // 2次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER3,                      // 3次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER4,                      // 4次重合闸时间 时间定值，整定范围：00.00s~99.99s	
	RE_RESET_TIME,						 // 重合闸复位时间
	RE_CHARGE_TIME,						 // 重合闸充电时间
	CURRENT_VALUE,                       // 电流定值
	VOLTAGE_VALUE,                       // 电压定值
	FAULT_CHECK_Y_TIME,                  // 故障检测Y时间
	SHORT_LOCKED_OPENING_TIME,           // 短时闭锁分闸时间
	LOSS_ELECTRICITY_SWITCH,             // 失电分闸投退 “1投入”、“0退出”
	LOSS_OPENING_TIME,                   // 分闸时间
	GET_VOLTAGE_CLOSSING_SWITCH,         // 得电合闸投退
	GET_VOLTAGE_CLOSSING_X_TIME,         // 得电延时合闸X时间
	SINGLE_LOSS_VOLTAGE_SWITCH,          // 单侧失压延时合闸
	SINGLE_LOSS_VOLTAGE_XLTIME,            // 单侧失压延时XL时间
	DOUBLE_VOLTAGE_SWITCH,               // 双侧有压禁止合闸投退
	REMAIN_VOLTAGE_SWITCH,               // 残压脉冲投退
	REMAIN_VOLTAGE_VALUE,                // 残压定值
	VOLTAGE_U0_SWITCH,                   // 零序电压保护投退
	VOLTAGE_U0_VALUE,                    // 零序电压值
	VOLTAGE_U0_TIME,                     // 零序电压延时
	BREAKING_CURRENT_SWITCH,             // 非遮断电流投退
	BREAKING_CURRENT_VALUE,        		 // 非遮断电流
	
	
	FIXED_VALUE_NUM                      // 定值数量
};
