jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
// 公共定值
typedef union TagPublicValue
{
    struct Public
    {
        float overCurrentSwitch1;                // 过流1段投退 “1投入”、“0退出”
        float directionLockSwitch1;              // 过流1段方向闭锁 “1投入”、“0退出”
        float overCurrentValue1;                 // 过流1段电流 流定值，整定范围：00.00A~99.99A
        float overCurrentTime1;                  // 过流1段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentSwitch2;                // 过流2段投退 “1投入”、“0退出”
        float directionLockSwitch2;              // 过流2段方向闭锁 “1投入”、“0退出”
        float overCurrentValue2;                 // 过流2段电流 电流定值，整定范围：00.00A~99.99A
        float overCurrentTime2;                  // 过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentSwitch3;                // 过流3段投退 “1投入”、“0退出”
        float directionLockSwitch3;              // 过流3段方向闭锁 “1投入”、“0退出”
        float overCurrentValue3;                 // 过流3段电流 电流定值，整定范围：00.00A~99.99A
        float overCurrentTime3;                  // 过流3段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Switch1;              // 零序过流1段投退 “1投入”、“0退出”
        float overCurrentI0Value1;               // 零序过流1段电流 流定值，整定范围：00.00A~99.99A
        float overCurrentI0Time1;                // 零序过流1段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Switch2;              // 零序过流2段投退 “1投入”、“0退出”
        float overCurrentI0Value2;               // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overCurrentI0Time2;                // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
        float overlimitAlarmSwitch;              // 越限报警功能投退
        float uplimitFactor;                     // 越限上限系数
        float downlimitFactor;                   // 越限下限系数
        float overlimitTime;                     // 越限延时
        float overlimitAlarmSwitchUab;           // Uab越限报警投退
        float overlimitAlarmSwitchUbc;           // Ubc越限报警投退
        float overlimitAlarmSwitchUac;           // Uac越限报警投退
        float uplimitVoltageU;                   // 电压上限定值
        float downlimitVoltageU;                 // 电压下限定值
        float overlimitAlarmSwitchIa;            // Ia越限报警投退
        float overlimitAlarmSwitchIb;            // Ib越限报警投退
        float overlimitAlarmSwitchIc;            // Ic越限报警投退
        float uplimitCurrentI;                   // 电流上限定值
        float downlimitCurrentI;                 // 电流下限定值
        float overlimitAlarmSwitchU0;            // 零序电压越限投退
        float uplimitVoltageU0;                  // 零序电压上限定值
        float downlimitVoltageU0;                // 零序电压下限定值
        float overlimitAlarmSwitchI0;            // 零序电流越限投退
        float uplimitCurrentI0;                  // 零序电流上限定值
        float downlimitCurrentI0;                // 零序电流下限定值
        float overlimitAlarmSwitchDC_U;          // 直流电压越限投退
        float uplimitDCVoltageU;                 // 直流电压上限定值
        float downlimitDCVoltageU;               // 直流电压下限定值
        float overlimitAlarmSwitchDC_I;          // 直流电流越限投退
        float uplimitDCCurrentI;                 // 直流电流上限定值
        float downlimitDCCurrentI;               // 直流电流下限定值
        float heavyOverloadSwitch;               // 重过载保护投退
        float heavyOverloadValue;                // 重过载定值
        float heavyOverloadFactor;               // 重过载返回系数
        float heavyOverloadTime;                 // 重过载延时
        float overloadSwitch;                    // 过负荷保护投退
        float overloadValue;                     // 过负荷定值
        float overloadFactor;                    // 过负荷返回系数
        float overloadTime;                      // 过负荷延时
        float batteryLowVoltageAlarmSwitch;      // 蓄电池低压报警投退
        float batteryLowVoltageValue;            // 电池低压定值
        float batteryLowVoltageFactor;           // 电池低压返回系数
        float batteryLowVoltageTime;             // 电池低压延时
        float batteryActiveSwitch;               // 电池活化周期投退
        float batteryActiveCycle;                // 电池活化周期(天)
        float batteryActiveTime;                 // 电池活化时间(h)
        float batteryActiveFaultVoltage;         // 电池活化故障电压
        float batteryActiveFaultTime;            // 电池活化故障延时
        float automaticResetEnable;              // 自动复归使能
        float automaticResetTime;                // 自动复位时间
        float overVoltageSwitch;                 // 过压投退
        float overVoltageValue;                  // 过压定值
        float overVoltageTime;                   // 过压时间
        float overVoltageFactor;                 // 过压返回系数
        float overFrequencySwitch;               // 过频投退
        float overFrequencyValue;                // 过频定值
        float overFrequencyTime;                 // 过频时间
        float overFrequencyFactor;               // 过频返回系数
        float downVoltageSwitch;                 // 低压投退
        float downVoltageValue;                  // 低压定值
        float downVoltageTime;                   // 低压时间
        float downVoltageFactor;                 // 低压返回系数
        float downFrequencySwitch;               // 低频投退
        float downFrequencyValue;                // 低频定值
        float downFrequencyTime;                 // 低频时间
        float downFrequencyFactor;               // 低频返回系数
        float closingLoopSwitch;                 // 合环功能投退
        float voltageDifference;                 // 两侧压差
        float phaseAngleDifference;				 // 相角差
        float controlloopAnomalyEnable;          // 控制回路异常使能
    } Str;

    float buf[sizeof(struct Public) / sizeof(float)];
} PublicValue;

// 断路器定值
typedef union TagBreakerValue
{
    struct Breaker
    {
        float inverseSwitch;                     // 反时限投退
        float inverseCurrentValue;               // 反时限保护电流值
        float inverseTime;                       // 反时限保护延时
        float iaccSwitch;                        // 后加速投退 软压板定值，可以选择“投入”、“退出"
        float iaccCurrentValue;                  // 后加速电流 电流定值，整定范围：00.00s~99.99A
        float iaccTime;                          // 后加速时间 时间定值，整定范围：00.00s~99.99s
        float inrushSwitch;                      // 涌流抑制投退 软压板定值，可以选择“投入”、“退出”
        float inrushTime;                        // 涌流抑制时间 时间定值，整定范围：0000~9999ms
        float secondaryRecloseLockSwitch;        // 二次重合闸闭锁投退
        float secondaryRecloseLockTime;          // 闭锁二次重合闸时间 时间定值，整定范围：00.00s~99.99
        float recloseTimesI;                     // 重合闸次数 可以选择：0，1，2，3，4
        float recloseTimesI0;                    // 零序重合闸次数 可以选择：0，1，2
        float recloseTimer1;                     // 1次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer2;                     // 2次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer3;                     // 3次重合闸时间 时间定值，整定范围：00.00s~99.99s
        float recloseTimer4;                     // 4次重合闸时间 时间定值，整定范围：00.00s~99.99s
		float reResetTime;						 // 重合闸复位时间
		float rechargeTime;						 // 重合闸充电时间
		
